chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
		/* System module initialization */
		.moduleInit =
		{SYS_MODULE_POWER_RUN_FULL},

		.operationMode = DRV_USBFS_OPMODE_DEVICE,

		.operationSpeed = USB_SPEED_FULL,

		/* Stop in idle */
		.stopInIdle = false,

		/* Suspend in sleep */
		.suspendInSleep = false,

		/* Identifies peripheral (PLIB-level) ID */
		.usbID = DRV_USBFS_PERIPHERAL_ID
	};

#endif
// </editor-fold>

#endif // _USB

// *****************************************************************************
// *****************************************************************************
// Section: System Data
// *****************************************************************************
// *****************************************************************************

/* Structure to hold the object handles for the modules in the system. */
HARMONY_SYSTEM_OBJECTS HarmonySysObj;

// </editor-fold>


// *****************************************************************************
// *****************************************************************************
// Section: Static Initialization Functions
// *****************************************************************************
// *****************************************************************************

void Harmony_SYS_InitDrivers(void* data)
{
	/* Initialize Drivers */

#if defined (_USB)
	#if defined(USB_DRV_HS)

		/* Initialize USB Driver */
		HarmonySysObj.drvUSBObject = DRV_USBHS_Initialize(DRV_USBHS_INDEX_0, (SYS_MODULE_INIT *)&drvUSBInit);
	#else
		/* Initialize USB Driver */
		HarmonySysObj.drvUSBObject = DRV_USBFS_Initialize(DRV_USBFS_INDEX_0, (SYS_MODULE_INIT *)&drvUSBInit);
	#endif
#endif
    
}

void Harmony_SYS_InitDevices(void* data)
{
    
#if defined (_USB)    
    /* Initialize the USB device layer */
    HarmonySysObj.usbDevObject0 = USB_DEVICE_Initialize(USB_DEVICE_INDEX_0, (SYS_MODULE_INIT*) & usbDevInitData);
#endif
    
}

void Harmony_SYS_InitApplication(void* data)
{
    Harmony_APP_Initialize();
}

// *****************************************************************************
// *****************************************************************************
// Section: System Interrupt Vector Functions
// *****************************************************************************
// *****************************************************************************

#if defined(_USB)

	#if defined(USB_DRV_HS)

		/* Implemented in wiring.c. Returns MS elapsed since power on. */
		extern unsigned long millis();

		/* Hacked time structure. */
		typedef struct _SYS_TIMER_OBJECT_HACK
		{
			uint32_t timerStartTime;
			uint32_t timerPeriod;
		}SYS_TIMER_OBJECT_HACK;

		/* Hacked timer instance.  One is all that is needed for USBHS driver. */
		static SYS_TIMER_OBJECT_HACK mTimerObjectHack = { 0, 0 };

		/* Hacked harmony timer function. We include headers but not the harmony source files for sys_tmr.c and drv_tmr.c */
		SYS_TMR_HANDLE SYS_TMR_DelayMS(uint32_t delayMs)
		{
			mTimerObjectHack.timerStartTime = millis();
			mTimerObjectHack.timerPeriod = delayMs;

			return (SYS_TMR_HANDLE)&mTimerObjectHack;
		}

		/* Hacked harmony timer function. We include headers but not the harmony source files for sys_tmr.c and drv_tmr.c */
		bool SYS_TMR_DelayStatusGet(SYS_TMR_HANDLE handle)
		{
			return ((millis() - ((SYS_TIMER_OBJECT_HACK*)handle)->timerStartTime) >= ((SYS_TIMER_OBJECT_HACK*)handle)->timerPeriod);
		}

		void Harmony_Service_USB(void)
		{
			gUsbIntCount++;
			DRV_USBHS_Tasks_ISR(HarmonySysObj.drvUSBObject);
		}
		void Harmony_Service_USBDMA(void)
		{
			gUsbDmaIntCount++;
			DRV_USBHS_Tasks_ISR_USBDMA(HarmonySysObj.drvUSBObject);
		}
		/*
		void __ISR(_USB_VECTOR, ipl6AUTO) _IntHandlerUSBInstance0(void)
		{

			DRV_USBHS_Tasks_ISR(HarmonySysObj.drvUSBObject);

		}
		void __ISR(_USB_DMA_VECTOR, ipl6AUTO) _IntHandlerUSBInstance0_USBDMA(void)
		{

			DRV_USBHS_Tasks_ISR_USBDMA(HarmonySysObj.drvUSBObject);

		}
		*/
	#else

		void __attribute__((vector(_USB_1_VECTOR), interrupt(ipl6SOFT), nomips16)) _IntHandlerUSBInstance0(void)
		{
			gUsbIntCount++;
			DRV_USBFS_Tasks_ISR(HarmonySysObj.drvUSBObject);
		}

	#endif

#endif

void Harmony_SYS_Tasks(void)
{
    /* Maintain system services */
    //    SYS_DEVCON_Tasks(HarmonySysObj.sysDevcon);

    /* Maintain Device Drivers */

    /* Maintain Middleware & Other Libraries */

#if defined(_USB)

	#if defined(USB_DRV_HS)
		/* USB FS Driver Task Routine */
		DRV_USBHS_Tasks(HarmonySysObj.drvUSBObject);
	#else
		/* USB FS Driver Task Routine */
		DRV_USBFS_Tasks(HarmonySysObj.drvUSBObject);
	#endif

    /* USB Device layer tasks routine */
    USB_DEVICE_Tasks(HarmonySysObj.usbDevObject0);

#endif
    
    /* Maintain the application's state machine. */
    Harmony_APP_Tasks();
}

/*******************************************************************************
 End of File
 */

